Revit 2024 API
BuiltInFailures.GeometryFailures Class
 Failures about GeometryFailures.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class GeometryFailures
Visual Basic
Public NotInheritable Class GeometryFailures
Visual C++
public ref class GeometryFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.GeometryFailures
See Also
BuiltInFailures.GeometryFailures Members
Autodesk.Revit.DB Namespace